soiv-dmp-test/src/main/resources/com/ericsson/soiv/teststeps/protocols/bscs/GetContractHistory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tic="http://ericsson.com/services/ws_CIL_6/ticklerssearch" xmlns:ses="http://ericsson.com/services/ws_CIL_6/sessionchange">
    <soapenv:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
                <Username>ADMX</Username>
                <Password>ADMX</Password>
            </UsernameToken>
        </Security>
    </soapenv:Header>
    <soapenv:Body>
        <tic:ticklersSearchRequest>
            <tic:inputAttributes>
                <tic:coIdPub>{{contractID}}</tic:coIdPub>
            </tic:inputAttributes>
            <tic:sessionChangeRequest>
                <ses:values>
                    <ses:item>
                        <ses:key>BU_ID</ses:key>
                        <ses:value>2</ses:value>
                    </ses:item>
                </ses:values>
            </tic:sessionChangeRequest>
        </tic:ticklersSearchRequest>
    </soapenv:Body>
</soapenv:Envelope>